# Task 05 - Part 1 of 2: SQL Aggregations & GROUP BY

**Course:** Database Applications Development  
**Lesson:** 05 - SQL Aggregations, Grouping, and Excel Export (in Part 2) 

---

## Instructions

Complete all exercises in this notebook. You will:
1. Write SQL queries using aggregate functions
2. Use GROUP BY to analyze categories
3. Export 4 query results to Excel files
4. Answer analysis questions

**Resources:**
- Lesson materials (dbApps05_AggregationsGrouping.md)
- Walkthrough notebook (dbApps05_Walkthrough.ipynb)
- SQL Reference Guide (updated with aggregations)

**Submission:**
1. Complete all TODO sections
2. Verify all cells run without errors
3. Check that Excel files were created (in Part 2)
4. Push to GitHub: `databaseApplications/dbApps05TasksPart1.ipynb`

Let's practice aggregations!

---

## Setup

In [1]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('nba_5seasons.db')
print("✅ Connected to database")

✅ Connected to database

---

## Part 1: Basic Aggregate Functions (10 queries)

Practice using COUNT, SUM, AVG, MIN, and MAX without GROUP BY.

**Hints:**
- Remember to use AS to name your result columns
- Aggregate functions work on ALL rows that match your WHERE clause
- Use ROUND(AVG(column), 1) to round decimals

### Query 1: Count All Teams

**Task:** How many teams are in the database?

**Hint:** Use COUNT(*) on the `teams` table.

In [2]:
# TODO: Write your query
query_1 = """
SELECT COUNT(*) AS team_count
FROM teams;
"""

result_1 = pd.read_sql(query_1, conn)
display(result_1)

   team_count
0          30

### Query 2: Count Player Season Records

**Task:** How many player-season records exist for 2021-22?

**Hint:** COUNT(*) from `player_season_stats` WHERE season = '2021-22'

In [3]:
# TODO: Write your query
query_2 = """
SELECT COUNT(*) AS season_stats
FROM player_season_stats
WHERE season = '2021-22';
"""

result_2 = pd.read_sql(query_2, conn)
display(result_2)

   season_stats
0           605

### Query 3: Total Points (All Teams)

**Task:** What were the total combined points scored by all teams in all 2021-22 games?

**Hint:** SUM(pts) from `team_game_stats` WHERE season = '2021-22'

In [4]:
# TODO: Write your query
query_3 = """
SELECT SUM(pts) FROM team_game_stats
WHERE season = '2021-22'
"""

result_3 = pd.read_sql(query_3, conn)
display(result_3)

   SUM(pts)
0    272115

### Query 4: Average Points Per Game (League-Wide)

**Task:** What was the league-wide average points per game in 2021-22?

**Hint:** AVG(pts), remember to round to 1 decimal place  (`team_game_stats` table)

In [5]:
# TODO: Write your query
query_4 = """
SELECT AVG(pts)
FROM team_game_stats
WHERE season = '2021-22'

"""

result_4 = pd.read_sql(query_4, conn)
display(result_4)

     AVG(pts)
0  110.615854

### Query 5: Highest and Lowest Scores

**Task:** Find the highest and lowest points scored in any single game during 2021-22.

**Hint:** Use both MAX(pts) and MIN(pts) in one query  (`team_game_stats` table)

In [6]:
# TODO: Write your query
query_5 = """
SELECT
MAX(pts), MIN(pts)
FROM team_game_stats
WHERE season = '2021-22'
"""

result_5 = pd.read_sql(query_5, conn)
display(result_5)

   MAX(pts)  MIN(pts)
0       158        75

### Query 6: Lakers Total Points

**Task:** How many total points did the Lakers (team_id = 1610612747) score in 2021-22?

**Hint:** SUM(pts) with WHERE for team_id AND season  (`team_game_stats` table)

In [7]:
# TODO: Write your query
query_6 = """
SELECT
SUM(pts)
FROM team_game_stats
WHERE team_id = 1610612747 AND season = '2021-22'
"""

result_6 = pd.read_sql(query_6, conn)
display(result_6)

   SUM(pts)
0      9192

### Query 7: Warriors Average Points

**Task:** What was the Warriors' (team_id = 1610612744) average points per game in 2021-22?

**Hint:** AVG(pts), round to 1 decimal (`team_game_stats` table)

In [8]:
# TODO: Write your query
query_7 = """
SELECT
ROUND(AVG(pts), 1)
FROM team_game_stats
WHERE team_id = 1610612744 AND season = '2021-22'
"""

result_7 = pd.read_sql(query_7, conn)
display(result_7)

   ROUND(AVG(pts), 1)
0               111.0

### Query 8: Complete Summary Statistics

**Task:** Create a summary with COUNT, SUM, AVG, MIN, and MAX for 'pts' for all games in 2021-22.

**Hint:** Use all 5 aggregate functions in one SELECT statement from the `team_game_stats` table

In [9]:
# TODO: Write your query
query_8 = """
SELECT
COUNT(pts) AS count,
SUM(pts) AS sum,
AVG(pts) AS average,
MIN(pts) AS min,
MAX(pts) AS max
FROM team_game_stats
WHERE season = '2021-22'

"""

result_8 = pd.read_sql(query_8, conn)
display(result_8)

   count     sum     average  min  max
0   2460  272115  110.615854   75  158

### Query 9: Count Teams by State

**Task:** How many teams are located in California?

**Hint:** COUNT(*) from `teams` WHERE state = 'California'

In [10]:
# TODO: Write your query
query_9 = """
SELECT COUNT(*)
FROM teams
WHERE state = 'California'
"""

result_9 = pd.read_sql(query_9, conn)
display(result_9)

   COUNT(*)
0         4

### Query 10: Oldest Team

**Task:** What is the earliest year_founded in the `teams` table?

**Hint:** MIN(year_founded)

In [11]:
# TODO: Write your query
query_10 = """
SELECT MIN(year_founded)
FROM teams
"""

result_10 = pd.read_sql(query_10, conn)
display(result_10)

   MIN(year_founded)
0               1946

---

## Part 2: GROUP BY Queries (8 queries)

Practice grouping data and aggregating by category.

**Remember:**
- Every non-aggregated column in SELECT must be in GROUP BY
- GROUP BY creates separate groups for aggregation
- Use ORDER BY to sort your results

### Query 11: Games Per Team

**Task:** How many games did each team play in 2021-22?

**Hint:** SELECT team_id, COUNT(*) ... GROUP BY team_id

In [12]:
# TODO: Write your query
query_11 = """
SELECT team_id, COUNT(*)
FROM team_game_stats
GROUP BY team_id
"""

result_11 = pd.read_sql(query_11, conn)
display(result_11.head(10))  # Show first 10 teams

      team_id  COUNT(*)
0  1610612737       363
1  1610612738       361
2  1610612739       363
3  1610612740       363
4  1610612741       361
5  1610612742       363
6  1610612743       361
7  1610612744       362
8  1610612745       359
9  1610612746       361

### Query 12: Average Points By Team

**Task:** Calculate average points per game for each team in 2021-22. Sort by highest average first.

**Hint:** GROUP BY team_id, ORDER BY avg_points DESC

In [13]:
# TODO: Write your query
query_12 = """
SELECT
ROUND(AVG(pts), 1) AS avg_points
FROM team_game_stats
GROUP BY team_id
ORDER BY avg_points DESC
"""

result_12 = pd.read_sql(query_12, conn)
display(result_12.head(10))  # Show first 10 teams

   avg_points
0       117.4
1       116.9
2       116.7
3       116.4
4       116.4
5       116.1
6       115.4
7       115.4
8       115.3
9       115.1

### Query 13: Team Performance with Names

**Task:** Show team name, games played, and average points for each team in 2021-22.

**Hint:** JOIN teams with team_game_stats, then GROUP BY

Recall from the walkthrough how JOIN operations work, here's an example:

SELECT <br>
    t.full_name as team,<br>
    t.city,<br>
    COUNT(tgs.game_id) as games_played<br>
FROM teams t<br>
JOIN team_game_stats tgs ON t.team_id = tgs.team_id<br>
WHERE tgs.season = '2021-22'<br>
GROUP BY t.team_id, t.full_name, t.city<br>
ORDER BY games_played DESC<br>
LIMIT 10

In [14]:
# TODO: Write your query
query_13 = """
SELECT
t.full_name as team,
COUNT(game_id) as games_played,
ROUND(AVG(pts), 1) AS avg_points
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name
"""

result_13 = pd.read_sql(query_13, conn)
display(result_13.head(10))

                    team  games_played  avg_points
0          Atlanta Hawks            82       113.9
1         Boston Celtics            82       111.8
2    Cleveland Cavaliers            82       107.8
3   New Orleans Pelicans            82       109.3
4          Chicago Bulls            82       111.6
5       Dallas Mavericks            82       108.0
6         Denver Nuggets            82       112.7
7  Golden State Warriors            82       111.0
8        Houston Rockets            82       109.7
9   Los Angeles Clippers            82       108.4

### Query 14: Total Points By Team

**Task:** Calculate total points scored by each team in 2021-22. Include team name.

**Hint:** SUM(pts), JOIN with `team_game_stats` with the `teams` table, GROUP BY team

In [15]:
# TODO: Write your query
query_14 = """
SELECT
t.full_name as team,
SUM(pts) as points
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name
"""

result_13 = pd.read_sql(query_13, conn)
display(result_13.head(30))

                      team  games_played  avg_points
0            Atlanta Hawks            82       113.9
1           Boston Celtics            82       111.8
2      Cleveland Cavaliers            82       107.8
3     New Orleans Pelicans            82       109.3
4            Chicago Bulls            82       111.6
5         Dallas Mavericks            82       108.0
6           Denver Nuggets            82       112.7
7    Golden State Warriors            82       111.0
8          Houston Rockets            82       109.7
9     Los Angeles Clippers            82       108.4
10      Los Angeles Lakers            82       112.1
11              Miami Heat            82       110.0
12         Milwaukee Bucks            82       115.5
13  Minnesota Timberwolves            82       115.9
14           Brooklyn Nets            82       112.9
15         New York Knicks            82       106.5
16           Orlando Magic            82       104.2
17          Indiana Pacers            82       111.5
18      Philadelphia 76ers            82       109.9
19            Phoenix Suns            82       114.8
20  Portland Trail Blazers            82       106.2
21        Sacramento Kings            82       110.3
22       San Antonio Spurs            82       113.2
23   Oklahoma City Thunder            82       103.7
24         Toronto Raptors            82       109.4
25               Utah Jazz            82       113.6
26       Memphis Grizzlies            82       115.6
27      Washington Wizards            82       108.6
28         Detroit Pistons            82       104.8
29       Charlotte Hornets            82       115.3

### Query 15: Season High by Team

**Task:** Find each team's highest-scoring game in 2021-22. Include team name and sort by highest game.

**Hint:** MAX(pts), JOIN, GROUP BY, ORDER BY DESC

In [16]:
# TODO: Write your query
query_15 = """
SELECT
t.full_name as team,
MAX(pts) as points
FROM teams t
JOIN team_game_stats tgs ON t.team_id = tgs.team_id
WHERE tgs.season = '2021-22'
GROUP BY t.team_id, t.full_name
ORDER BY pts DESC
"""

result_15 = pd.read_sql(query_15, conn)
display(result_15.head(10))

                     team  points
0       Charlotte Hornets     158
1       San Antonio Spurs     157
2    Los Angeles Clippers     153
3      Washington Wizards     153
4       Memphis Grizzlies     152
5           Brooklyn Nets     150
6  Minnesota Timberwolves     149
7         Houston Rockets     146
8      Los Angeles Lakers     146
9          Boston Celtics     145

### Query 16: Win Count by Team

**Task:** Count how many wins each team had in 2021-22.

**Hint:** Use SUM(CASE WHEN wl = 'W' THEN 1 ELSE 0 END) to count wins

In [17]:
# TODO: Write your query
query_16 = """
SELECT 
    team_id,
    SUM(CASE WHEN wl = 'W' THEN 1 ELSE 0 END) AS wins
FROM team_game_stats
GROUP BY team_id;

"""

result_16 = pd.read_sql(query_16, conn)
display(result_16.head(10))

      team_id  wins
0  1610612737   176
1  1610612738   254
2  1610612739   226
3  1610612740   156
4  1610612741   180
5  1610612742   191
6  1610612743   231
7  1610612744   209
8  1610612745   156
9  1610612746   199

### Query 17: Teams by State

**Task:** Count how many teams are in each state.

**Hint:** GROUP BY state from teams table

In [18]:
# TODO: Write your query
query_17 = """
SELECT 
    team_id,
    COUNT(*) AS player_season_stats
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id;

"""

result_17 = pd.read_sql(query_17, conn)
display(result_17.head(10))

      team_id  player_season_stats
0  1610612737                   21
1  1610612738                   22
2  1610612739                   22
3  1610612740                   18
4  1610612741                   20
5  1610612742                   21
6  1610612743                   20
7  1610612744                   16
8  1610612745                   16
9  1610612746                   16

### Query 18: Players Per Team

**Task:** Count how many player-season records each team has for 2021-22.

**Hint:** COUNT(*) from player_season_stats, GROUP BY team_id

In [19]:
# TODO: Write your query
query_18 = """
SELECT team_id, COUNT(*) player_season_stats
FROM teams
GROUP BY team_id
"""

result_18 = pd.read_sql(query_18, conn)
display(result_18.head(10))

      team_id  player_season_stats
0  1610612737                    1
1  1610612738                    1
2  1610612739                    1
3  1610612740                    1
4  1610612741                    1
5  1610612742                    1
6  1610612743                    1
7  1610612744                    1
8  1610612745                    1
9  1610612746                    1

## You've completed Part 1 - Nice Work!

## Now move onto Part 2!